{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [6, 64]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [64]}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "dense_2/kernel", "shape": [64, 64]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [64]}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "dense_3/kernel", "shape": [64, 3]}, {"dtype": "float32", "name": "dense_3/bias", "shape": [3]}], "paths": ["group3-shard1of1"]}], "modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "batch_input_shape": [null, 6]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "trainable": true}}]}, "backend": "tensorflow", "keras_version": "2.1.4", "training_config": {"loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "amsgrad": false, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033}}, "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null}}}